app/views/artists/show.html.erb

<ul>
  <% @artist.songs.each do |song| %>
---
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" IS NULL LIMIT ?  [["artist_id", 1], ["LIMIT", 1]]